#!/bin/sh
######################################################################
## 本地自动化发布配置，下面你需要修改相关参数
######################################################################

# 服务器地址
host=124.222.190.75

# 服务器用户
user=root

# 项目目录
project=./docs/.vuepress/dist/*

# 部署到指定的目录
path=/html/note/ygw/default

# 是否启用压缩传输（TODO: 本地tar压缩后scp，服务器tar解压）
trans_zip=false

######################################################################
## 在这里添加你的自定义命令，可以用来定制构建化工作
######################################################################

rm -rf $project
npm run docs:build

######################################################################
## 以下是自动化发布脚本，尽量不要碰我 ~
######################################################################

# SSH 连接地址
server="${user}@${host}"

# 发布远程的绝对路径
deploy_to="${server}:${path}"

# 远程创建发布目录
ssh $server "mkdir -p ${path}"

# 传输相关文件
scp -r $project $deploy_to

